app/Models/Usuario.php

    public function obtenerUsuario($data)
    {
        $Usuario = $this->db->table('personas');
        $Usuario->where($data);
        return $Usuario->get()->getResultArray();
---
SELECT *
FROM `personas`
WHERE `usuario` = 'e1'